import os 
import sys
import time 
def slow(T):
    for r in T + '':
        sys.stdout.write(r)
        sys.stdout.flush()
        time.sleep(0.0)
def seo(T):
    for r in T + '\n':
        sys.stdout.write(r)
        sys.stdout.flush()
        time.sleep(0.0)
def seo_is_taemC4():
    anim = ["[\x1b[1;91m■\x1b[0m□□□□□□□□□","[\x1b[1;92m■■\x1b[0m□□□□□□□□", "[\x1b[1;93m■■■\x1b[0m□□□□□□□", "[\x1b[1;95m■■■■\x1b[0m□□□□□□", "[\x1b[1;94m■■■■■\x1b[0m□□□□□", "[\x1b[38;5;26m■■■■■■\x1b[0m□□□□", "[\x1b[1;96m■■■■■■■\x1b[0m□□□", "[\x1b[38;5;86m■■■■■■■■\x1b[0m□□", "[\x1b[38;5;96m■■■■■■■■■\x1b[0m□", "[\x1b[38;5;203m■■■■■■■■■■\x1b[0m]"]
    am = ('\x1b[38;5;203m','\x1b[38;5;203m','\x1b[38;5;203m','\x1b[38;5;203m','\x1b[38;5;203m','\x1b[38;5;203m')
    for i in range(0):
        time.sleep(0.1)
        os.system('clear')
        sys.stdout.write(f"\r \x1b[38;5;203mdecode_TAEMC4_Tools... \033[1;92m" + anim[i % len(anim)] +"\x1b[0m ")
        sys.stdout.write(f"\r \x1b[38;5;203mdecode_TAEMC4_Tools ... \033[1;92m" + am[i % len(am)] +"\x1b[0m ")
        sys.stdout.flush()
seo_is_taemC4()
os.system('clear')
import os
try:
 from cfonts import render, say
except:
 os.system('pip install python-cfonts')
output = render('T A E M C 4', colors=['white', 'green'], align='center')
print(output)
SEO='''        
██████╗     ███████╗     ██████╗     ██████╗     ██████╗     ███████╗
██╔══██╗    ██╔════╝    ██╔════╝    ██╔═══██╗    ██╔══██╗    ██╔════╝
██║  ██║    █████╗      ██║         ██║   ██║    ██║  ██║    █████╗  
██║  ██║    ██╔══╝      ██║         ██║   ██║    ██║  ██║    ██╔══╝  
██████╔╝    ███████╗    ╚██████╗    ╚██████╔╝    ██████╔╝    ███████╗
╚═════╝     ╚══════╝     ╚═════╝     ╚═════╝     ╚═════╝     ╚══════╝
'''
slow(SEO) 
P = '\x1b[1;97m'
M = '\x1b[1;91m'
H = '\x1b[1;92m'
K = '\x1b[1;93m'
B = '\x1b[1;94m'
U = '\x1b[1;95m' 
O = '\x1b[1;96m'
N = '\x1b[0m'    
Z = "\033[1;30m"
sir = '\033[41m\x1b[1;97m'
x = '\33[m' # DEFAULT
m = '\x1b[1;91m' 
k = '\033[93m' 
h = '\x1b[1;92m' 
hh = '\033[32m' 
u = '\033[95m' 
kk = '\033[33m' 
b = '\33[1;96m'
p = '\x1b[0;34m'
Black = '\033[0;30m'        
Red = '\033[0;31m'       
Green = '\033[0;32m'       
Yellow = '\033[0;33m'     
Blue = '\033[0;34m'         
purple = '\033[0;35m'    
Cyan = '\033[0;36m'        
White = '\033[0;37m'
sir = '\033[41m\x1b[1;97m'
x = '\33[m' # DEFAULT
m = '\x1b[1;91m' #RED +
k = '\033[93m' # KUNING +
h = '\x1b[1;92m' # HIJAU +
hh = '\033[32m' # HIJAU -
u = '\033[95m' # UNGU
kk = '\033[33m' # KUNING -
b = '\33[1;96m' # BIRU -
p = '\x1b[0;34m' # BIRU +
def dec():
	print()
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m01\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;29mMarshal \33[m[\x1b[0;41m\x1b[3;4m3.9\33[m] ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m02\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;31mMarshal \x1b[0;34m[\x1b[0;41m\x1b[0;4m3.11\x1b[0;34m] ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m03\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;34mMarshal \033[0;35m[\x1b[0;41m\x1b[7;4m3.12\033[0;35m]')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m04\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;35mMarshal \033[1;30m[\x1b[0;41m\x1b[00;4m3.13\033[1;30m]')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m05\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;33m Enc \x1b[0;31mMaeyouf ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m06\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;99mHEX ➤ \x1b[0;33mbase64 \x1b[0m➤ \x1b[0;34mzlib ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m07\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;34mEasy oBf ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m08\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[0m ➤ \033[36mBase64 \x1b[0m➤\x1b[0;32m Base16 \x1b[0m➤ \x1b[0;31mBase32 \x1b[0m➤ \x1b[0;34mBase85 ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m09\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[33m zlib ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m10\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;37mlzma \x1b[0m➤ \033[0;34mzlib ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m11\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;35m  \033[0;32mgzip ➤ \033[0;30mlzma \x1b[0m➤ \033[0;31mzilb ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m12\33[m〗\033[1;34m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[0;33mexec((lambda _____, ______ : ______ ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m13\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[0;34mBase64 \x1b[1;32m\x1b[1;97m\x1b[1;97m ➤ \033[0;33mzlib ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m14\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0m ➤ \033[0;32mBy \033[0;31mUncompyle6 ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m15\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \x1b[0;32mBy \x1b[0;38mMardis ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m16\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[0;32mBy \x1b[1;99mPycdc ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m17\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[1;30mStrings ')   
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m18\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[1;32mM.Maeyouf ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m19\33[m〗\033[0;37m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[1;49mlock 🔒 ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m20\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[1;35mLambda\x1b[1;97m ➤ \x1b[1;32m\033[1;33mMarshal \x1b[1;37m ➤ \x1b[38;5;5m\033[1;32mBase64 \x1b[1;37m\x1b[1;97m ➤ \x1b[38;5;208m\033[1;31mZlib \x1b[1;37m[\x1b[1;32mV1\x1b[1;37m] ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m21\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0m ➤ \033[1;36mLambda \x1b[1;32m\x1b[1;97m ➤ \033[1;30mMarshal\x1b[38;5;208m\x1b[1;97m ➤ \033[1;33mBase64 \x1b[0;34m\x1b[1;97m ➤ \033[1;20mZlib \x1b[1;37m[\x1b[1;32mV2\x1b[1;37m] ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m22\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤ \033[1;37mMarsha\x1b[1;37m \x1b[1;32m\x1b[1;97m ➤ \033[1;34mBase64\x1b[1;37m\x1b[1;97m ➤ \x1b[38;5;208m\033[1;30mB85 ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo("\33[m〖\x1b[1;32m23\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0m ➤\033[1;31m _= lambda __ : __import__('zlib'). ")
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo("\33[m〖\x1b[1;32m24\33[m〗\x1b[1;31m \x1b[1;97m ➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0;34m\x1b[1;97m ➤\033[1;37m _= lambda __ : __import__('base64'). ")
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m25\33[m〗\x1b[1;31m \x1b[1;97m➤ \033[41m\x1b[1;97m⌯╼═══❬Decode❭═══╾⌯\x1b[0m  ➤ \033[1;30mLambda \x1b[38;5;208m\x1b[1;97m ➤ \033[1;37mMarshal \x1b[1;37m\x1b[1;32m\x1b[1;97m ➤ \033[1;34mBase64 \x1b[1;37m\x1b[1;97m➤  \033[1;37mZlib \x1b[1;37m[\x1b[1;32mV3\x1b[1;37m] ')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
seo('\33[m〖\x1b[1;32m00\33[m〗\x1b[1;31m \x1b[1;97m➤ Exit tool')
seo('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
se = int(input("\033[0;44m𝘾𝙝𝙤𝙤𝙨𝙚 ➥ :\x1b[0m "))
slow('\033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬       \033[0;31m▬▭▬▬▭▬▬▭▬▬▭▬▬▭▬▭▬▬')
if se == 1:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/GO/marshal.py')
	#os.system(f'python3.9 tools_TAEMC4.py')
elif se == 2:
	os. system('clear')
	os.system(f'python3 /storage/emulated/0/c4_tools/DECODE_PYTHON/GO2/tools_TAEMC4.py')
elif se == 3:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/GO3/dec.py')
elif se == 4:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/GO4/dec2.py')

elif se == 5:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/GO5/seo.py')
elif se == 6:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/GO6/pycdc/seo/TAEMC4/decode/pycdc.py')
elif se == 7:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/GO7/n.py')
elif se == 8:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 9:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/milb.py')
elif se == 10:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/GO6/pycdc/seo/TAEMC4/decode/pycdc.py')
elif se == 11:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 12:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/GO12/bn.py')
elif se == 13:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 15:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 16:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/milb.py')
elif se == 17:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/decode_bot.py')
elif se == 18:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 19:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/Go19/milb.py')
elif se == 20:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/milb.py')
elif se == 21:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/decode_bot.py')
elif se == 22:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 23:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/seo.py')
elif se == 24:
	os. system('clear')
	os.system(f'python3.9 /storage/emulated/0/c4_tools/DECODE_PYTHON/milb.py')
elif se == 25:
	os. system('clear')
	os.system(f'python /storage/emulated/0/c4_tools/DECODE_PYTHON/decode_bot.py')
else:
	print('Erorr selected')
	exit()
		
		
dec()
